tutorials/multiphase/vof/vofSolver/laminar/waves/squarePile/0.org/p_rgh
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    bottom
    {
        type            slip;
    }
    atmosphere
    {
        type            totalPressure;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }

}


// ************************************************************************* //
