tutorials/multiphase/vof/vofSolver/laminar/waves/squarePile/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-1 -10 -1)
    ( 1 -10 -1)    
    (-1 -10  1)
    ( 1 -10  1)
    (-3.82843 -10 -3.82843)
    ( 3.82843 -10 -3.82843)
    (-3.82843 -10  3.82843)
    ( 3.82843 -10  3.82843)
    (-28.2843 -10 -28.2843)
    ( 28.2843 -10 -28.2843)
    (-28.2843 -10  28.2843)
    ( 28.2843 -10  28.2843)
    
    (-1 3 -1)
    ( 1 3 -1)    
    (-1 3  1)
    ( 1 3  1)
    (-3.82843 3 -3.82843)
    ( 3.82843 3 -3.82843)
    (-3.82843 3  3.82843)
    ( 3.82843 3  3.82843)
    (-28.2843 3 -28.2843)
    ( 28.2843 3 -28.2843)
    (-28.2843 3  28.2843)
    ( 28.2843 3  28.2843)    
    
);

blocks          
(
    hex (4 5 17 16 0 1 13 12) (20 120 20) simpleGrading (1 1 0.1)
    hex (4 0 12 16 6 2 14 18) (20 120 20) simpleGrading (0.1 1 1)
    hex (1 5 17 13 3 7 19 15) (20 120 20) simpleGrading (10 1 1)
    hex (2 3 15 14 6 7 19 18) (20 120 20) simpleGrading (1 1 10)
    hex (8 9 21 20 4 5 17 16) (20 120 50) simpleGrading (1 1 1)
    hex (8 4 16 20 10 6 18 22) (50 120 20) simpleGrading (1 1 1)
    hex (5 9 21 17 7 11 23 19) (50 120 20) simpleGrading (1 1 1)
    hex (6 7 19 18 10 11 23 22) (20 120 50) simpleGrading (1 1 1)
);

edges           
(
    arc 8 9 (0 -10 -40)
    arc 8 10 (-40 -10 0)
    arc 10 11 (0 -10 40)
    arc 11 9 (40 -10 0) 
    
    arc 20 21 (0 3 -40)
    arc 20 22 (-40 3 0)
    arc 22 23 (0 3 40)
    arc 23 21 (40 3 0) 
);

patches         
(
    patch inlet
    (
        (8 20 22 10)
        (8 9 21 20)
        (9 11 23 21)
        (10 11 23 22)
    )
    wall cylinder 
    (
        (0 1 13 12)
        (1 3 15 13)
        (2 3 15 14)
        (0 12 14 2)
    )
    wall bottom 
    (
        (8 9 5 4)
        (4 5 1 0)
        (1 5 7 3)
        (5 9 11 7)
        (2 3 7 6)
        (6 7 11 10)
        (4 0 2 6)
        (8 4 6 10)
    )
    patch atmosphere 
    (
        (16 17 13 12)
        (20 21 17 16)
        (13 17 19 15)
        (17 21 23 19)
        (16 12 14 18)
        (20 16 18 22)
        (14 15 19 18)
        (18 19 23 22)
    )
    
);

mergePatchPairs
(
);

// ************************************************************************* //
